app/Controllers/AdminController.php

    public function index()
    {

        $movimientoModel = new Movimiento();
        // Obtén la fecha actual en formato 'Y-m-d'
        $currentDate = date('Y-m-d');

        // Establece la hora inicial y final del día actual
        $startDate = $currentDate . ' 00:00:00';
        $endDate = $currentDate . ' 23:59:59';

        // Consulta para obtener el total de ingresos por día (agrupado por año, mes y día)
        $totalIngresos = $movimientoModel
            ->select('DATE(fecha) as fecha, SUM(monto) as total_ingresos')
            ->where('movimiento', 1)
            ->where('id_usuario', $this->session->user_id)
            ->where('fecha >=', $startDate)
            ->where('fecha <=', $endDate)
            ->groupBy('DATE(fecha)')
            ->findAll();

        // Consulta para obtener el total de egresos por día (agrupado por año, mes y día)
        $totalEgresos = $movimientoModel
            ->select('DATE(fecha) as fecha, SUM(monto) as total_egresos')
            ->where('movimiento', 2)
            ->where('id_usuario', $this->session->user_id)
            ->where('fecha >=', $startDate)
            ->where('fecha <=', $endDate)
            ->groupBy('DATE(fecha)')
            ->findAll();
---
SELECT DATE(fecha) as fecha, SUM(monto) as total_ingresos
FROM `movimientos`
WHERE `movimiento` = 1
AND `id_usuario` = '1'
AND `fecha` >= '2024-01-20 00:00:00'
AND `fecha` <= '2024-01-20 23:59:59'
GROUP BY DATE(fecha)
SELECT DATE(fecha) as fecha, SUM(monto) as total_egresos
FROM `movimientos`
WHERE `movimiento` = 2
AND `id_usuario` = '1'
AND `fecha` >= '2024-01-20 00:00:00'
AND `fecha` <= '2024-01-20 23:59:59'
GROUP BY DATE(fecha)

        $startDate = $firstDayOfWeek . ' 00:00:00';

        // Consulta para obtener el total de ingresos por día de la semana
        $totalIngresosPorDiaSemana = $movimientoModel
            ->select('DAYNAME(fecha) as dia_semana, SUM(monto) as total_ingresos')
            ->where('movimiento', 1)
            ->where('id_usuario', $this->session->user_id)
            ->where('fecha >=', $startDate)
            ->where('fecha <=', $endDate)
            ->groupBy('DAYNAME(fecha)')
            ->orderBy('FIELD(dia_semana, "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday")')
            ->findAll();

        // Consulta para obtener el total de egresos por día de la semana
        $totalEgresosPorDiaSemana = $movimientoModel
            ->select('DAYNAME(fecha) as dia_semana, SUM(monto) as total_egresos')
            ->where('movimiento', 2)
            ->where('id_usuario', $this->session->user_id)
            ->where('fecha >=', $startDate)
            ->where('fecha <=', $endDate)
            ->groupBy('DAYNAME(fecha)')
            ->orderBy('FIELD(dia_semana, "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday")')
            ->findAll();
---
SELECT DAYNAME(fecha) as dia_semana, SUM(monto) as total_ingresos
FROM `movimientos`
WHERE `movimiento` = 1
AND `id_usuario` = '1'
AND `fecha` >= '2024-01-14 00:00:00'
AND `fecha` <= '2024-01-20 23:59:59'
GROUP BY DAYNAME(fecha)
ORDER BY FIELD(dia_semana, "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday")
SELECT DAYNAME(fecha) as dia_semana, SUM(monto) as total_egresos
FROM `movimientos`
WHERE `movimiento` = 2
AND `id_usuario` = '1'
AND `fecha` >= '2024-01-14 00:00:00'
AND `fecha` <= '2024-01-20 23:59:59'
GROUP BY DAYNAME(fecha)
ORDER BY FIELD(dia_semana, "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday")