app/Controllers/ComprobanteController.php

SELECT *
FROM `comprobantes`
---
    public function show($id)
    {
        $comprobanteModel = new Comprobante();
        $data['data'] = $comprobanteModel->findAll();