app/Controllers/LoginController.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'admin'
OR `correo` = 'admin'
 LIMIT 1
---
    public function login()
    {
        $data['register'] = false;
        $validation = \Config\Services::validation();
        $validation->setRule('usuario', 'usuario', 'required');
        $validation->setRule('password', 'contraseña', 'required');

        if (!$validation->withRequest($this->request)->run()) {
            $data['username_error'] = $validation->getError('usuario');
            $data['password_error'] = $validation->getError('password');

            return view('admin/login', $data);
        }

        $userModel = new \App\Models\Usuario();
        $username = $this->request->getVar('usuario');
        $password = $this->request->getVar('password');

        $user = $userModel->where('usuario', $username)
            ->orWhere('correo', $username)
            ->first();