app/Controllers/MovimientoController.php

SELECT `movimientos`.*, `c`.`nombre` AS `comprobante`, `u`.`usuario`
FROM `movimientos`
JOIN `comprobantes` AS `c` ON `movimientos`.`id_comprobante` = `c`.`id`
JOIN `usuarios` AS `u` ON `movimientos`.`id_usuario` = `u`.`id`
WHERE `movimientos`.`estado` = 1
---
    public function show($id)
    {
        $movimientoModel = new Movimiento();
        if ($this->session->rol == 'admin') {
            $data['data'] = $movimientoModel->select('movimientos.*, c.nombre AS comprobante, u.usuario')
                ->join('comprobantes AS c', 'movimientos.id_comprobante = c.id')
                ->join('usuarios AS u', 'movimientos.id_usuario = u.id')
                ->where('movimientos.estado', 1)
                ->findAll();

SELECT *
FROM `movimientos`
WHERE `movimientos`.`id` = '12'
SELECT *
FROM `cajas`
WHERE `estado` = 1
AND `id_usuario` = '1'
 LIMIT 1
SELECT SUM(`monto`) AS `monto`
FROM `movimientos`
WHERE `movimiento` = 1
AND `id_caja` = '1'
AND `id_usuario` = '1'
 LIMIT 1
SELECT SUM(`monto`) AS `monto`
FROM `movimientos`
WHERE `movimiento` = 2
AND `id_caja` = '1'
AND `id_usuario` = '1'
 LIMIT 1
---
    public function update($id)
    {
        $data = [];

        $movimientoModel = new Movimiento();
        $comprobante = $movimientoModel->find($id);

        // Si el formulario se ha enviado
        if ($this->request->getMethod() === 'put') {
            // Validación de reglas
            $validationRules = [
                'monto' => 'required',
                'descripcion' => 'required',
                'comprobante' => 'required',
                'radio-switch-name' => 'required',
            ];

            // Establecer reglas de validación
            if ($this->validate($validationRules)) {
                $cajaModel = new Caja();
                $caja = $cajaModel->where(['estado' => 1, 'id_usuario' => $this->session->user_id])->first();
                if (empty($caja)) {
                    return redirect()->to('admin/movimientos')->with('error', 'La caja esta cerrada.');
                } else {
                    if ($this->request->getPost('radio-switch-name') == 2) {
                        //COMPROBAR SALDO
                        $consultaIngresos = $movimientoModel->selectSum('monto')
                            ->where(['movimiento' => 1, 'id_caja' => $caja['id'], 'id_usuario' => $this->session->user_id])
                            ->first();

                        $consultaEgresos = $movimientoModel->selectSum('monto')
                            ->where(['movimiento' => 2, 'id_caja' => $caja['id'], 'id_usuario' => $this->session->user_id])
                            ->first();

UPDATE `movimientos` SET `monto` = '40.00', `descripcion` = 'prueba fecha', `fecha` = '2024-01-27 19:38', `movimiento` = '2', `id_comprobante` = '2'
WHERE `movimientos`.`id` IN ('12')
---
                        'id_comprobante' => $this->request->getPost('comprobante'),
                    ];

                    $movimientoModel->update($id, $data);

SELECT *
FROM `movimientos`
JOIN `usuarios` ON `usuarios`.`id` = `movimientos`.`id_usuario`
WHERE `movimientos`.`id_usuario` = '1'
ORDER BY `movimientos`.`id` DESC
SELECT *
FROM `configuracion`
 LIMIT 1
---
    public function generarReportePdf()
    {
        $movimientoModel = new Movimiento();
        if (empty($_GET['desde']) && empty($_GET['hasta'])) {
            $movimientos = $movimientoModel
                ->where('movimientos.id_usuario', $this->session->user_id)
                ->join('usuarios', 'usuarios.id = movimientos.id_usuario')
                ->orderBy('movimientos.id', 'desc')
                ->findAll();
        } else {
            $desde = $_GET['desde'] . ' 00:00:00';
            $hasta = $_GET['hasta'] . ' 23:23:59';
            $movimientos = $movimientoModel
                ->where('movimientos.id_usuario', $this->session->user_id)
                ->join('usuarios', 'usuarios.id = movimientos.id_usuario')
                ->where('movimientos.fecha >=', $desde)
                ->where('movimientos.fecha <=', $hasta)
                ->orderBy('movimientos.id', 'desc')
                ->findAll();
        }
        $datos = new Configuracion();
        $empresa = $datos->first();