app/Controllers/UsuarioController.php

SELECT *
FROM `usuarios`
---
    public function show($id)
    {
        $usuarioModel = new Usuario();
        $data['data'] = $usuarioModel->findAll();